mediaMicroservices/wrk2/nospec3_60s_r150.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 5066.797ms, rate sampling interval: 15843ms
  Thread calibration: mean lat.: 4932.116ms, rate sampling interval: 15089ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    27.27s    10.91s   46.56s    58.23%
    Req/Sec    15.00      1.15    16.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   28.64s 
 75.000%   36.18s 
 90.000%   41.68s 
 99.000%   46.56s 
 99.900%   49.25s 
 99.990%   49.71s 
 99.999%   49.71s 
100.000%   49.71s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7835.647     0.000000            1         1.00
   11739.135     0.100000          149         1.11
   15949.823     0.200000          297         1.25
   18841.599     0.300000          446         1.43
   24264.703     0.400000          593         1.67
   28639.231     0.500000          741         2.00
   30228.479     0.550000          816         2.22
   31703.039     0.600000          890         2.50
   33554.431     0.650000          966         2.86
   34734.079     0.700000         1040         3.33
   36175.871     0.750000         1113         4.00
   37060.607     0.775000         1149         4.44
   38273.023     0.800000         1186         5.00
   39256.063     0.825000         1225         5.71
   39944.191     0.850000         1260         6.67
   40828.927     0.875000         1297         8.00
   41320.447     0.887500         1317         8.89
   41680.895     0.900000         1334        10.00
   42139.647     0.912500         1353        11.43
   42467.327     0.925000         1371        13.33
   42860.543     0.937500         1390        16.00
   43122.687     0.943750         1399        17.78
   43352.063     0.950000         1408        20.00
   43745.279     0.956250         1419        22.86
   44138.495     0.962500         1427        26.67
   44498.943     0.968750         1437        32.00
   44662.783     0.971875         1442        35.56
   44957.695     0.975000         1445        40.00
   45219.839     0.978125         1450        45.71
   45580.287     0.981250         1455        53.33
   46006.271     0.984375         1459        64.00
   46137.343     0.985938         1463        71.11
   46202.879     0.987500         1464        80.00
   46563.327     0.989062         1467        91.43
   46858.239     0.990625         1469       106.67
   47054.847     0.992188         1471       128.00
   47087.615     0.992969         1472       142.22
   47546.367     0.993750         1473       160.00
   47579.135     0.994531         1474       182.86
   47906.815     0.995313         1476       213.33
   47939.583     0.996094         1477       256.00
   47939.583     0.996484         1477       284.44
   48201.727     0.996875         1478       320.00
   48201.727     0.997266         1478       365.71
   48267.263     0.997656         1479       426.67
   48726.015     0.998047         1480       512.00
   48726.015     0.998242         1480       568.89
   48726.015     0.998437         1480       640.00
   48726.015     0.998633         1480       731.43
   49250.303     0.998828         1481       853.33
   49250.303     0.999023         1481      1024.00
   49250.303     0.999121         1481      1137.78
   49250.303     0.999219         1481      1280.00
   49250.303     0.999316         1481      1462.86
   49709.055     0.999414         1482      1706.67
   49709.055     1.000000         1482          inf
#[Mean    =    27273.223, StdDeviation   =    10905.520]
#[Max     =    49676.288, Total count    =         1482]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1773 requests in 1.00m, 329.06KB read
  Non-2xx or 3xx responses: 62
Requests/sec:     29.55
Transfer/sec:      5.48KB