mediaMicroservices/wrk2/nospec3_60s_r25.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 184.633ms, rate sampling interval: 668ms
  Thread calibration: mean lat.: 179.761ms, rate sampling interval: 625ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   606.35ms    1.06s    4.92s    87.75%
    Req/Sec    10.90      4.43    20.00     79.08%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  136.83ms
 75.000%  366.33ms
 90.000%    2.19s 
 99.000%    4.92s 
 99.900%    5.48s 
 99.990%    5.87s 
 99.999%    5.87s 
100.000%    5.87s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      65.599     0.000000            1         1.00
      88.383     0.100000          115         1.11
      96.831     0.200000          229         1.25
     105.727     0.300000          343         1.43
     117.183     0.400000          459         1.67
     136.831     0.500000          572         2.00
     148.607     0.550000          630         2.22
     171.007     0.600000          686         2.50
     197.503     0.650000          743         2.86
     240.895     0.700000          801         3.33
     369.407     0.750000          858         4.00
     520.959     0.775000          886         4.44
     737.791     0.800000          915         5.00
     982.015     0.825000          943         5.71
    1294.335     0.850000          972         6.67
    1631.231     0.875000         1001         8.00
    1917.951     0.887500         1015         8.89
    2191.359     0.900000         1030        10.00
    2330.623     0.912500         1043        11.43
    2635.775     0.925000         1058        13.33
    2879.487     0.937500         1072        16.00
    3069.951     0.943750         1079        17.78
    3246.079     0.950000         1086        20.00
    3463.167     0.956250         1093        22.86
    3663.871     0.962500         1101        26.67
    3938.303     0.968750         1108        32.00
    4038.655     0.971875         1111        35.56
    4075.519     0.975000         1115        40.00
    4112.383     0.978125         1118        45.71
    4440.063     0.981250         1122        53.33
    4632.575     0.984375         1126        64.00
    4694.015     0.985938         1127        71.11
    4808.703     0.987500         1129        80.00
    4911.103     0.989062         1131        91.43
    4919.295     0.990625         1133       106.67
    5021.695     0.992188         1135       128.00
    5021.695     0.992969         1135       142.22
    5140.479     0.993750         1137       160.00
    5140.479     0.994531         1137       182.86
    5189.631     0.995313         1138       213.33
    5255.167     0.996094         1139       256.00
    5255.167     0.996484         1139       284.44
    5349.375     0.996875         1140       320.00
    5349.375     0.997266         1140       365.71
    5398.527     0.997656         1141       426.67
    5398.527     0.998047         1141       512.00
    5398.527     0.998242         1141       568.89
    5484.543     0.998437         1142       640.00
    5484.543     0.998633         1142       731.43
    5484.543     0.998828         1142       853.33
    5484.543     0.999023         1142      1024.00
    5484.543     0.999121         1142      1137.78
    5869.567     0.999219         1143      1280.00
    5869.567     1.000000         1143          inf
#[Mean    =      606.345, StdDeviation   =     1064.944]
#[Max     =     5865.472, Total count    =         1143]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1400 requests in 1.00m, 254.27KB read
  Socket errors: connect 0, read 0, write 0, timeout 6
  Non-2xx or 3xx responses: 16
Requests/sec:     23.33
Transfer/sec:      4.24KB