mediaMicroservices/wrk2/nospec3_60s_r50.out
Running 1m test @ http://localhost:8080/wrk2-api/review/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 522.519ms, rate sampling interval: 1770ms
  Thread calibration: mean lat.: 434.953ms, rate sampling interval: 1569ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   609.99ms  601.59ms   2.71s    86.12%
    Req/Sec    23.69      3.79    31.00     83.05%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  367.61ms
 75.000%  815.10ms
 90.000%    1.46s 
 99.000%    2.71s 
 99.900%    3.42s 
 99.990%    3.68s 
 99.999%    3.68s 
100.000%    3.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      73.727     0.000000            1         1.00
     129.791     0.100000          241         1.11
     164.607     0.200000          483         1.25
     227.839     0.300000          722         1.43
     295.423     0.400000          963         1.67
     367.615     0.500000         1203         2.00
     420.095     0.550000         1324         2.22
     481.279     0.600000         1444         2.50
     562.175     0.650000         1565         2.86
     679.423     0.700000         1685         3.33
     815.103     0.750000         1805         4.00
     894.975     0.775000         1866         4.44
     977.407     0.800000         1925         5.00
    1062.911     0.825000         1985         5.71
    1157.119     0.850000         2046         6.67
    1285.119     0.875000         2106         8.00
    1374.207     0.887500         2136         8.89
    1456.127     0.900000         2167        10.00
    1561.599     0.912500         2196        11.43
    1709.055     0.925000         2226        13.33
    1845.247     0.937500         2256        16.00
    1914.879     0.943750         2271        17.78
    2027.519     0.950000         2286        20.00
    2096.127     0.956250         2301        22.86
    2166.783     0.962500         2316        26.67
    2242.559     0.968750         2332        32.00
    2263.039     0.971875         2339        35.56
    2293.759     0.975000         2347        40.00
    2324.479     0.978125         2354        45.71
    2365.439     0.981250         2361        53.33
    2420.735     0.984375         2369        64.00
    2473.983     0.985938         2373        71.11
    2578.431     0.987500         2376        80.00
    2664.447     0.989062         2380        91.43
    2772.991     0.990625         2384       106.67
    2811.903     0.992188         2388       128.00
    2848.767     0.992969         2390       142.22
    2859.007     0.993750         2391       160.00
    3051.519     0.994531         2394       182.86
    3057.663     0.995313         2395       213.33
    3205.119     0.996094         2397       256.00
    3213.311     0.996484         2398       284.44
    3282.943     0.996875         2399       320.00
    3297.279     0.997266         2400       365.71
    3338.239     0.997656         2401       426.67
    3354.623     0.998047         2402       512.00
    3354.623     0.998242         2402       568.89
    3416.063     0.998437         2403       640.00
    3416.063     0.998633         2403       731.43
    3424.255     0.998828         2404       853.33
    3424.255     0.999023         2404      1024.00
    3424.255     0.999121         2404      1137.78
    3647.487     0.999219         2405      1280.00
    3647.487     0.999316         2405      1462.86
    3647.487     0.999414         2405      1706.67
    3647.487     0.999512         2405      2048.00
    3647.487     0.999561         2405      2275.56
    3680.255     0.999609         2406      2560.00
    3680.255     1.000000         2406          inf
#[Mean    =      609.987, StdDeviation   =      601.587]
#[Max     =     3678.208, Total count    =         2406]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2906 requests in 1.00m, 523.02KB read
  Non-2xx or 3xx responses: 5
Requests/sec:     48.43
Transfer/sec:      8.72KB